<?php
//登录cookie配置
$config['cookie']['prefix'] = '51wom';
$config['cookie']['authkey'] = 'auth';
$config['cookie']['cryptkey'] = 'kdi##20.83(&%$63ldwl';
$config['cookie']['ad'] = 'ad';
$config['cookie']['media'] = 'media';
$config['cookie']['frontexpire'] = 86400 * 30;

$config['cookie']['indexuserkey'] = 'authindex';//前端用户cookie的key
$config['cookie']['wxuserkey'] = 'authwx';//微信用户cookie的key
$config['cookie']['chartkey'] = 'authchart';//购物车cookie的key

//密码加密
$config['passwd']['cryptkey'] = 'kdil2!!@8EfJI37.020##dEie';

//注册step2加密
$config['register']['cryptkey'] = '51wom';

//URL规则
$config['route']['rewrite'] = array(
    // Image View
    '/^view\/(?<biz>banner)\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/view',
    '/^view\/(?<biz>banner)\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)_(?<crop>c)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/view',
    '/^view\/(?<biz>banner)\/(?<key>[a-z0-9]{40})\.(?<ext>.*)$/i' => '/file/index/view',
    '/^view\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/view',
    '/^view\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)_(?<crop>c)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/view',
    '/^view\/(?<key>[a-z0-9]{40})\.(?<ext>.*)$/i' => '/file/index/view',

    // File Download
    '/^download\/(?<biz>banner)\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/download',
    '/^download\/(?<biz>banner)\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)_(?<crop>c)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/download',
    '/^download\/(?<biz>banner)\/(?<key>[a-z0-9]{40})\.(?<ext>.*)$/i' => '/file/index/download',
    '/^download\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/download',
    '/^download\/(?<key>[a-z0-9]{40})\/(?<w>\d+)x(?<h>\d+)_(?<crop>c)\.(?<ext>jpg|gif|png|bmp)$/i' => '/file/index/download',
    '/^download\/(?<key>[a-z0-9]{40})\.(?<ext>.*)$/i' => '/file/index/download',

    '/^company\/login$/i' => '/admin/login/type/2',
    '/^user\/login$/i' => '/admin/login/type/3',
    '/^supplier\/login$/i' => '/admin/login/type/4',
    '/^tj$/i' => '/index/account/cdlogin',
);

$config['sImgFont'] = APP_PATH . '/../conf/STZHONGS.ttf';
//$config['attachments'] = '/data/51wom/attachments';

$config['domain']['www'] = ENV_DOMAIN;
$config['domain']['static'] = ENV_DOMAIN;
$config['domain']['file'] = ENV_DOMAIN;

// LOG配置
$config['logger']['sBaseDir'] = APP_PATH . '/../logs';
$config['logger']['common'] = array(
    'sSplit' => 'Ymd',
    'sDir' => 'common'
);

// URL配置
$config['url']['upload'] = 'http://' . ENV_DOMAIN . '/file/upload';
$config['url']['dfsview'] = 'http://' . ENV_DOMAIN . '/view';
$config['url']['bannerupload'] = 'http://' . ENV_DOMAIN . '/file/bannerupload';

// 邮箱跳转
$config['aMailServer'] = array(
    '163.com' => 'http://mail.163.com',
    'gmail.com' => 'https://gmail.com',
    'qq.com' => 'http://mail.qq.com',
    '126.com' => 'http://mail.126.com',
    'sohu.com' => 'http://mail.sohu.com',
    'sina.com.cn' => 'http://mail.sina.com.cn',
    '139.com' => 'http://mail.10086.cn',
    'tom.com' => 'http://mail.tom.com',
    'aliyun.com' => 'https://mail.aliyun.com'
);

// 短信模板
$config['aSmsTempID'] = array(
    '8' => 95656,        //用户登录
    '9' => 95656,        //忘记密码,绑定手机
    '10' => 95656,       //用户注册
    '11' => 95678        //体检通知
);

//51joying专用短信
$config['aJoyingSms'] = [
    'account' => 'sdk_zhongyingbx',
    'password' => '20150921'
];

$config['web'] = [
    'sZixunPhone' => '400-816-6768',//咨询电话
    'sTel' => '4008166768',
];

$config['aReviewStatus'] = [
    0 => '已删除',
    1 => '审核通过',
    2 => '待审核',
    3 => '审核未通过'
];

$config['aUserType'] = [
    1 => '中盈员工',
    2 => '企业用户',
    3 => '个人用户'
];

//状态(1=正常，2=锁定，3=离职， 4=待验证)
$config['aCompanyState'] = [
    1 => '正常',
    2 => '锁定',
    3 => '离职',
    4 => '待验证',
];

//证件类型(1=身份证,2=护照,3=军官证,4=返乡证,5=驾驶证,6=港澳证,7=其他)
$config['aCardType'] = [
    1 => '身份证',
    2 => '护照',
    3 => '军官证',
    4 => '返乡证',
    5 => '驾驶证',
    6 => '港澳证',
    7 => '其他',
];

//与本人关系(1=配偶,2=父母,3=子女,4=其他)
$config['aRelationship'] = [
    1 => '配偶',
    2 => '父母',
    3 => '子女',
    4 => '其他'
];

//职位(config配置)
$config['aPosition'] = [
    1 => '办公室工作人员',
    2 => '管理人员',
    3 => '会计',
    4 => '建筑师',
    5 => '其他'
];

//职位(config配置)
$config['aSex'] = [
    1 => '男',
    2 => '女'
];

$config['aMarriage'] = [
    1 => '未婚',
    2 => '已婚'
];

$config['aImport']['sex'] = [
    '男' => 1,
    '女' => 2
];
$config['aImport']['marriage'] = [
    '未婚' => 1,
    '已婚' => 2
];

$config['sMail'] = "亲爱的员工 [收件人],您好！

    网站登录地址为：[登录地址]

    您的账号为：[账号]

    初始密码为：[密码]，登录后请尽快修改密码。

    本邮件由系统自动发送，请勿回复。";

//客户性质
$config['aProperty'] = [
    '请选择',
    '外资(欧美)',
    '外资(非欧美)',
    '合资(欧美)',
    '合资(非欧美)',
    '国企',
    '民营企业',
    '外企代表处',
    '政府机关',
    '事业单位',
    '非盈利机构',
    '其它性质'
];

//信用等级
$config['aCreditLevel'] = [
    '请选择',
    '一般',
    '良好',
    '非常好',
    '黑名单'
];
//关系等级
$config['aRelationLevel'] = [
    '请选择',
    '一般',
    '良好',
    '非常好'
];
//行业
$config['aIndustry'] = [
    '请选择',
    'IT多领域经营',
    '通讯技术',
    '计算机软件',
    '网络游戏',
    '计算机硬件、系统和网络',
    '互联网（电子商务）',
    '电子设备／摄影器材',
    '工业自动化／仪表/仪器',
    '电子／半导体',
    '工程(电气,机械与路桥)',
    '机械和机电',
    '汽车及零配件',
    '耐用消费品（家电／家具／工艺品／玩具）',
    '快速消费品（食品／饮料／烟草／化妆品）',
    '医疗设备／仪器',
    '制药、保健品和生物工程',
    '医疗卫生',
    '美容保健',
    '化工、石化和原材料',
    '环保产业',
    '能源',
    '制造业（生产）',
    '冶金和钢铁',
    '印刷和包装',
    '运输、物流和快递',
    '航天、航空',
    '零售和批发',
    '贸易和代理',
    '服装和纺织',
    '旅游和酒店',
    '餐饮业',
    '娱乐、运动和休闲',
    '影视、媒体、艺术',
    '银行、保险和金融服务',
    '政府和公共事业',
    '咨询',
    '教育、培训和科研',
    '财务和审计',
    '法律服务',
    '广告、公关及有关行业',
    '报刊、广播、再版和电视',
    '房地产、建筑和装潢',
    '建材',
    '农业、林业和渔业',
    '采掘、地质和水利',
    '家居、室内设计、装潢',
    '物业管理／商业中心',
    '检测、认证',
    '多元化业务集团',
    '其它'
];
//客户渠道
$config['aChannel'] = [
    '请选择',
    '自有客户',
    '上海AF',
    '北京AF',
    '中智科创'
];
//员工数量
$config['aUserNum'] = [
    '请选择',
    '少于50人',
    '50-150人',
    '150-500人',
    '500-1000人',
    '1000-5000人',
    '5000-10000人',
    '10000人以上',
];
$config['aAuthenticateType'] = [
    '身份证+手机号码',
    '身份证'
];
$config['aSendMassage'] = [
    '全部发送',
    '仅发送给AF客户经理',
    '仅发送给企业Hr'
];
$config['aLockUser'] = [
    '否',
    '是'
];
$config['aCanLoadReport'] = [
    '否',
    '是'
];
$config['aCommunicateLevel'] = [
    '一般',
    '重要'
];
$config['aCommunicateResult'] = [
    '未联系上',
    '无意向',
    '有意向',
    '非常有意向'
];
$config['product']['aPCard'] = [
    0 => '请选择',
    1 => '基础卡',
    2 => '经典卡',
    3 => '精英卡',
    4 => '卓越卡',
    5 => '红日卡',
    6 => '定制体检卡',
];
$config['product']['aCardType'] = [
    1 => '安心体检卡',
    2 => '中智体检卡',
];

$config['card']['aStatus'] = [
    1 => '已使用',
    3 => '未使用',
    2 => '无效',
];

$config['cardproduct']['aStatus'] = [
    1 => '可用',
    2 => '不可用',
    3 => '已使用',
];

$config['card']['aSendStatus'] = [
    0 => '未发放',
    1 => '已发放',
];

$config['card']['aUseType'] = [
    1 => '套餐中任选一个产品',
    2 => '套餐中产品均可用',
];

$config['product']['aAttribute'] = [
    1 => '常规套餐',
    2 => '入职检查'
];
$config['product']['aStatus'] = [
    2 => '未发布',
    1 => '已发布',
    3 => '已下架'
];
$config['product']['aCodeStatus'] = [
    1 => '未修改',
    2 => '已修改',
];
$config['product']['aSex'] = [
    1 => '男',
    2 => '女未婚',
    3 => '女已婚'
];
$config['product']['aType'] = [
    1 => '专项检查',
    2 => '体检套餐'
];
$config['product']['aSpecial'] = [
    1 => '妇科检查',
    2 => '男科检查',
    3 => '儿科检查',
    4 => '眼科检查',
    5 => '在配置文件中添加'
];
$config['product']['aStoreType'] = [
    1 => '连锁门店',
    2 => '公立医院',
    3 => '齿科医院',
    4 => '其他',
];
$config['product']['aAddtionType'] = [
    1 => '单项加项',
    2 => '组合单项',
    3 => '服务加项',
];

$config['product']['aChannelType'] = [
    1 => '公司用户',
    2 => '个人用户',
];

$config['product']['aCanView'] = ['全部', '部分可见', '部分不可见'];

$config['faq']['category'] = [
    1 => '保险常见问题',
    2 => '网站新闻',
    3 => '体检常见问题',
    4 => '理赔常见问题',
    5 => '理赔小知识',
    6 => '在线报名',
];

$config['physical']['prestatus'] = [
    0 => '待确认',
    1 => '已确认'
];
$config['physical']['type'] = [
    1 => '常规体验',
    2 => '入职体验'
];
$config['physical']['paytype'] = [
    1 => '个人支付',
    2 => '公司支付'
];
$config['physical']['status'] = [
    0 => '未预约',
    1 => '已预约',
    2 => '已到检',
    3 => '已退订',
    4 => '作废',
    5 => '已出报告',
    6 => '预约失败'
];
$config['physical']['plat'] = [
    1 => 'PC',
    2 => '微信'
];

$config['store']['aShopLevel'] = [
    0 => '0.00',
    1 => '0.50',
    2 => '1.00',
    3 => '1.50',
    4 => '2.00',
    5 => '2.50',
    6 => '3.00',
    7 => '3.50',
    8 => '4.00',
    9 => '4.50',
    10 => '5.00'
];

$config['store']['aStoreCategory'] = [
    1 => '医疗单位',
    2 => '保险公司',
];

$config['store']['aStoreProperty'] = [
    1 => '体检机构',
    2 => '公立医院',
    3 => '第三方合作机构',
    4 => '民营医院',
    5 => '部队医院',
];

$config['balance']['aStatus'] = [
    1 => '待处理',
    2 => '已邮寄发票',
    3 => '已打款'
];
$config['order']['aPayStatus'] = [
    0 => '未付款',
    1 => '已付款'
];
$config['order']['aPayType'] = [
    1 => '在线支付',
    2 => '汇款支付',
    3 => '公司支付'
];
$config['order']['aGenStatus'] = [
    0 => '未生成',
    1 => '已生成'
];
$config['order']['aCardType'] = [
    1 => '电子卡',
    2 => '实体卡'
];
$config['order']['aIfInv'] = [//是否需要发票
    0 => '否',
    1 => '是'
];
$config['order']['aShippingStatus'] = [
    0 => '所有',
    1 => '未发货',
    2 => '已发货',
    3 => '备货中'
];

$config['order']['aOrderType'] = [
    1 => '电子卡',
    2 => '实体卡',
    3 => '体检产品',
    4 => '体检计划',
    5 => '产品升级'
];

//生成分享码的key
$config['token'] = 'wxfjdp';

//微信公众号
$config['wxConfig'] = [
    '120.24.78.234:88' => [
        'APPID' => 'wxe1ef91363266b378',
        'APPSECRET' => '91a7bcf1603eb05fefe181185b938601',
        'TOKEN' => 'aaaabbbbccccdddd',
        'ACTIVESTART' => 'Ov3IFc9DquehwbLMq9khxECHIIXw4yAc6tdxinQihb0',//任务开始提醒模板
        'MCHID' => '1321444201', // 商户ID
        'PAYKEY' => '69805779a07a78588a5c07c71ce400a5', // MD5 ("m18116208033@163.com")
    ],
    '51joying.iyaoshow.com' => [
        'APPID' => 'wx0f300403e00477d3',
        'APPSECRET' => '3e60b93e9d23b8b46d7959892946ff76',
        'TOKEN' => 'aaaabbbbccccdddd',
        'ACTIVESTART' => 'oe9QCs7H32NyWliirNhCSFFPPom2fAlwLuctCA4-Dvw',//任务开始提醒模板
        'MCHID' => '1312140701', // 商户ID
        'PAYKEY' => '8bd6493042c485b68bcab9a542b212d1', // MD5 ("fjdptech@qq.com")
    ],
    '51joying.zhibiyun.com' => [
        'APPID' => 'wx0f300403e00477d3',
        'APPSECRET' => '3e60b93e9d23b8b46d7959892946ff76',
        'TOKEN' => 'aaaabbbbccccdddd',
        'ACTIVESTART' => 'oe9QCs7H32NyWliirNhCSFFPPom2fAlwLuctCA4-Dvw',//任务开始提醒模板
        'MCHID' => '1312140701', // 商户ID
        'PAYKEY' => '8bd6493042c485b68bcab9a542b212d1', // MD5 ("fjdptech@qq.com")
    ],
    'tijian.51joying.com' => [
        'APPID' => 'wx6ea6d06f77667874',
        'APPSECRET' => '02a1a7f117c68d3c5ac17053e30e85d0',
        'TOKEN' => 'aaaabbbbccccdddd',
        'ACTIVESTART' => 'oe9QCs7H32NyWliirNhCSFFPPom2fAlwLuctCA4-Dvw',//任务开始提醒模板
        'MCHID' => '1362351502', // 商户ID
        'PAYKEY' => 'www51joyingcom123456789123456789',
    ],
];

$config['suppliers']['aStatus'] = [
    0 => '不可预约',
    1 => '可以预约',
    2 => '不可预约',//节假日情况
    3 => '预约已满'
];


$config['suppliers']['aHasApi'] = [//有接口的供应商
    'ruici-sh' => [
        'classname' => 'Ruici'
    ],
    'renai' => [
        'classname' => 'Renai'
    ],
    'meinian-sh' => [
        'classname' => 'Meinian'
    ],
    'aikang-sh' => [
        'classname' => 'Ikang'
    ],
    'ciming-sh' => [
        'classname' => 'Ciming'
    ],
];

$config['suppliers']['aReservedate'] = [//没有接口的供应商
    'wode' => [//沃德医疗
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 1,//周四是否可约
        5 => 1,//周五是否可约
        6 => 1,//周六是否可约
        7 => 1,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 3,//延期的工作日
    ],
    'quanjing' => [//全景
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 1,//周四是否可约
        5 => 1,//周五是否可约
        6 => 0,//周六是否可约
        7 => 0,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 3,//延期的工作日
    ],
    'yuyiguan' => [//寓医馆
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 1,//周四是否可约
        5 => 1,//周五是否可约
        6 => 1,//周六是否可约
        7 => 1,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 3,//延期的工作日
    ],
    'xuhuizhongxin' => [//徐汇区中心医院
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 1,//周四是否可约
        5 => 1,//周五是否可约
        6 => 0,//周六是否可约
        7 => 0,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 5,//延期的工作日
    ],
    '108hospital-sh' => [//108医院
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 1,//周四是否可约
        5 => 1,//周五是否可约
        6 => 1,//周六是否可约
        7 => 0,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 3,//延期的工作日
    ],
    'jinkang' => [//景康
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 0,//周四是否可约
        5 => 1,//周五是否可约
        6 => 1,//周六是否可约
        7 => 1,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 3,//延期的工作日
    ],
    'huadong' => [//华东医院
        1 => 1,//周一是否可约
        2 => 1,//周二是否可约
        3 => 1,//周三是否可约
        4 => 1,//周四是否可约
        5 => 1,//周五是否可约
        6 => 0,//周六是否可约
        7 => 0,//周日是否可约
        8 => 0,//节假日是否可约
        9 => 3,//延期的工作日
    ],
];

//接口api签名
$config['signkey'] = '51joying';

//百度APIkey
$config['baiduapi']['apikey'] = '6ebfb22e38ebcf8e479b177aa1c8c7ad';

//免除签名的ip
$config['allowip'] = array();

//邮件登陆地址
$config['loginUrl'] = 'http://tijian.51joying.com/tj';


$config['employee']['mail'] = '[收件人],您好！

    福利平台的访问地址为：[登录地址]

    您的账号为：[账号]

    初始密码为：[密码](未登录修改过)

    公司会定期推出优惠的保险理财产品，尽请关注。

    本邮件由系统自动发送，请勿回复。';

$config['physical']['account'] = '

您的账号为：【账号】，
初始密码为：【初始密码】';

//员工体检通知
$config['physical']['mail'] = '
尊敬的【员工姓名】<br/>
恭喜您通过【公司名称】的年度健康体检，为了您顺利完成完成体检，请详细阅读以下注意事项：<br/>
1）体检有效期：【体检开始日期】至【体检截止日期】<br/>
   体检地点：就近选择<br/>
2）预约方式：请登录 “安心入职体检预约平台”选择体检门店和体检时间。<br/>
（注：请提前3-7天登陆预约平台确定体检时间；对没有预约者，体检中心将会现场婉拒体检，敬请谅解。）<br/>
3）携带物品：体检当日，请您空腹并携带本人有效身份证件，前往所选择的体检中心出示预约成功短信，进行身体检查。<br/>
您可以根据自身的需求，以公司优惠价自费升级高人气体检套餐。<br/>
安心体检祝您检后安心！ <br/>
安心体检预约登陆平台【安心体检】<br/>
体检卡号：【体检卡号】<br/>
此邮件为系统自动发送，请勿直接回复。<br/>
安心体检客服热线：400-816-6768<br/>
温馨提示：<br/>
到检时请向体检中心表明您是安心体检的客户，有助于体检中心快速确认您的身份！<br/>

';

$config['physical']['msg'] = '【员工姓名】您好，【公司名称】年度健康体检即将开始喽! 
为确保您的体检顺利完成，请尽快登录 “安心体检平台”及您的预留邮箱查看相关体检安排！
安心体检，祝您检后安心！
安心体检预约登陆平台：http://tijian.51joying.com/tj
微信预约平台：“中盈安心服务”微信号
体检卡号：【体检卡号】

';

$config['physical']['mail2'] = '
尊敬的【员工姓名】<br/>
恭喜您通过【公司名称】的面试，为了您顺利完成入职体检，请详细阅读以下注意事项：<br/>
1）体检有效期：【体检开始日期】至【体检截止日期】<br/>
2）预约方式：请登录 “安心入职体检预约平台”选择体检门店和体检时间。<br/>
（注：请提前3-7天登陆预约平台确定体检时间；对没有预约者，体检中心将会现场婉拒体检，敬请谅解。）<br/>
3）携带物品：体检当日，请您空腹并携带本人有效身份证件，前往所选择的体检中心出示预约成功短信，进行身体检查。 <br/>
我们预祝您的加入！愿【公司名称】成为您事业的新起点！';

$config['physical']['msg2'] = '【员工姓名】您好！恭喜您通过【公司名称】公司的面试。
为了保障您的顺利入职，请您务必于【开始时间】—【结束时间】完成入职体检。
请登录“安心体检平台”及您的预留邮箱查看相关体检安排，我们预祝您的加入！
安心体检预约登陆平台：http://tijian.51joying.com/tj
微信预约平台：“中盈安心服务”微信号
体检卡号：【体检卡号】';

//HR体检通知
//体检套餐：【体检套餐】
$config['physical']['planmail'] = '
尊敬的【公司名称】,您好： <br/>
贵司【体检计划】年度健康体检计划已安排，体检具体信息安排如下：<br/>
体检有效期：【体检开始日期】—【体检截止日期】<br/>
体检人数：【体检人数】人<br/>
体检流程：<br/>
我们将于近日以电子邮件和短信的形式，告知贵司员工相关体检流程。<br/>
为了保证体检质量和控制体检人数，安心体检将实行体检预约制度，对没有预约者，体检中心将会现场婉拒体检，敬请谅解。<br/>
A请建议员工提前3-7个工作日进行网上预约<br/>
b请员工依次填写真实的个人信息，注意不要有缺项，确认手机号码，以确保贵司员工接收用户名及密码<br/>
c您可登陆安心体检企业HR平台，查看贵司年度体检相关进展。<br/>
d任何问题请致电中智客服经理或致电安心体检客服热线：400-816-6768<br/>

感谢您对安心体检的信任与选择！祝您工作愉快<br/>
';

$config['physical']['planmsg'] = '
【公司名称】您好，贵司【体检计划】年度健康体检计划已安排，请登录 “安心体检企业HR平台” 或查收您预留邮箱查看贵司相关的体检信息，感谢您对安心体检的信任与选择！祝您工作愉快！
安心体检企业HR登陆平台：http://tijian.51joying.com/admin/hrlogin <br/>
企业登陆用户名：【账号】
企业登陆密码：【密码】
';


//到检前短信通知
$config['physical']['predaymsg'] = '
尊敬的【员工姓名】：
感谢您预约了明天【体检门店】的【体检套餐】的体检。
安心体检温馨提示您【体检日期】上午8点-10点前请空腹至【体检门店】行您的年度体检，抵达后请向体检中心工作人员出示本人身份证原件，确认您的体检套餐后进行体检。 
为了确保各项检查指标结果的准确，建议您今天保持饮食清淡，注意休息，晚上8点以后请勿进食，保证充足睡眠。
安心体检，祝您检后安心！
安心体检客服热线：400-816-6768';

//年度体检催检邮件和短信
$config['physical']['clockmail'] = '
尊敬的【员工姓名】：<br/>
贵公司为您安排的年度体检即将到期喽! <br/>
为了不要错过公司为您安排的体检福利，也为了您能更好的了解自身的健康状况，请您尽快安排时间完成体检。请仔细阅读以下体检须知。<br/>
一、体检日期及地点<br/>
体检有效期：【体检开始日期】至【体检截止日期】<br/>
体检地点：就近选择<br/>
二、预约体检流程<br/>
预约网站：请登录 “安心体检预约平台”或扫描邮件中二维码直接登录：<br/>
a）为了保证体检质量，让您有一个良好的体检环境和贴心的服务、安心体检实行体检预约制度，如果未经预约，体检中心将会现场婉拒体检。<br/>
b）请务必提前3-7个工作日网上预约。<br/>
您可以根据自身的需求，以公司优惠价自费升级高人气体检套餐。<br/>
安心体检祝您检后安心！<br/>
安心体检预约登陆平台：http://tijian.51joying.com/tj<br/>
体检卡号：【体检卡号】
此邮件为系统自动发送，请勿直接回复。<br/>
安心体检客服热线：400-816-6768';

$config['physical']['clockmsg'] = '
【员工姓名】您好，
贵公司为您安排的【体检计划】年度体检即将到期喽！请您尽快安排时间完成体检，您可登录 “安心体检平台”或扫描邮件中的二维码直接预约，相关体检安排请查看您的邮件！ 
安心体检预约登陆平台：http://tijian.51joying.com/tj<br/>
微信预约平台：“中盈安心服务”微信号
体检卡号：【体检卡号】
';

//体检延期短信
$config['physical']['delaymsg'] = '
【员工姓名】您好，
您的体检有效期即将到期，贵司人事部为了避免您可能错过公司体检福利，特将您的年度健康体检延期至【体检截止日期】，努力工作的同时，记得也要关爱自己的身体哦！
安心体检预约登陆平台：http://tijian.51joying.com/tj<br/>
微信预约平台：“中盈安心服务”微信号
体检卡号：【体检卡号】
';

//体检卡购买成功
// $config['physical']['cardmail'] = '
// 尊敬的【员工姓名】：<br/>
// 感谢您购买了【体检套餐】，您的套餐登录卡号为：【体检卡号】<br/>
// 请登录安心体检平台http://www.51joying.com/tj.aspx或“中盈安心服务”微信号，输入以上号码即可进行登录及预约。<br/>
// 安心体检，祝您检后安心！<br/>
// 为了保证体检质量，让您有一个良好的体检环境和贴心的服务、安心体检实行体检预约制度，如果未经预约，体检中心将会现场婉拒体检。<br/>
// 此邮件为系统自动发送，请勿直接回复。<br/>
// 安心体检客服热线：400-816-6768
// ';

// $config['physical']['cardmsg'] = '
// 尊敬的【员工姓名】：
// 感谢您购买了【体检套餐】，您的套餐登录卡号为：【体检卡号】，请登录安心体检平台http://www.51joying.com/tj.aspx或“中盈安心服务”微信号，输入以上号码即可进行登录及预约。安心体检，祝您检后安心！
// 客服热线：400-816-6768
// ';
$config['physical']['cardmail'] = '
尊敬的【员工姓名】：<br/>
感谢您购买安心体检卡<br/>
请登录安心体检平台：http://tijian.51joying.com/tj<br/>个人中心或“中盈安心服务”微信号查看购卡信息。<br/>
安心体检，祝您检后安心！<br/>
为了保证体检质量，让您有一个良好的体检环境和贴心的服务、安心体检实行体检预约制度，如果未经预约，体检中心将会现场婉拒体检。<br/>
此邮件为系统自动发送，请勿直接回复。<br/>
安心体检客服热线：400-816-6768
';

$config['physical']['cardmsg'] = '
尊敬的【员工姓名】：
感谢您购买了安心体检卡，请登录安心体检平台：http://tijian.51joying.com/tj
个人中心或“中盈安心服务”微信号查看购卡信息
客服热线：400-816-6768
';

// 体检支付成功短信
$config['physical']['paymsg'] = '
【员工姓名】您好！ 
您已向安心体检成功支付【体检价格】元的体检费用，您参加的体检套餐为【体检套餐】，请注意查收体检预约确认短信及邮件，安心体检，祝您检后安心！
';


// 体检预约成功邮件 短信
$config['physical']['ordermail'] = '
尊敬的【员工姓名】您好！ <br/>
您已成功预约了于【体检日期】的【体检套餐】体检，以下为体检确认信息：<br/>
体检日期：【体检日期】<br/>
体检地点：【体检门店】,【体检地点】<br/>
营业时间：【营业时间】<br/>
附近交通：【附近交通】<br/>
特别提示：体检当日，请携带本人有效身份证件，至体检中心表明您是安心体检的客户，有助于体检中心快速确认您的身份；如您有事无法前往，请提前24小时退订，过期不允许退订。敬请留意！<br/>
安心体检客服热线：400-816-6768 

*温馨提示：<br/>
体检前注意事项：<br/>
1、体检前三天应清淡饮食，忌高脂、高蛋白、高糖、高盐饮食，忌酒，保持正常作息，避免疲劳；忌食对肝、肾功能有损害的药物。<br/>
2、体检前一天晚上8时后尽量避免进食、剧烈运动或情绪波动，可少量饮水，保持充足睡眠。睡眠不足会影响血糖、血脂、血压的检测结果。<br/>
3、体检当日清晨，请空腹（禁食水），以便进行抽血及上腹B超检查。（若糖尿病、高血压、心脏病、哮喘等慢性疾病患者，请将平时服用的药物携带备用，受检日建议不要停药）<br/>
4、请带好有效身份证件。<br/>

体检当日流程及注意事项<br/>
1、为了避免人多体检时间过长，体检当日请尽量提早前往。到检时请向体检中心表明您是安心体检的客户，有助于体检中心快速确认您的身份。<br/>
2、请务必在10：30之前完成空腹采血体检项目检查，同时体检当日请先进行体检空腹项目的检查。<br/>
3、请在体检过程中配合导检人员的引导，如发现问题请及时与咨询导检人员或体检医生联系，应积极配合医生的各项检查，请勿擅自更改自己的体检项目。<br/>
4、如需进行妇科B超检查，请保持膀胱充盈（憋尿）。如需妇检，检查前请排清小便。<br/>
5、怀孕、可能已怀孕者、半年内备孕者，请预先告知医护人员，勿做Χ光及宫颈涂片检查；女性在月经期内请不要留取尿液标本及妇检，月经期后再做检查。<br/>
6、完成全部体检项目，到前台交体检表。如需邮寄纸质体检报告，请告知前台并自行支付快递费用。';

$config['physical']['ordermsg'] = '
【员工姓名】您好！ 
您已成功预约了于【体检日期】的【体检套餐】体检，请于体检当日前往【体检门店】，出示本人有效身份证件及本短信进行体检。安心体检祝您检后安心感谢！
体检地点：【体检地点】（详细交通路线请见邮件）
安心体检客服热线：400-816-6768';

//体检报告短信邮件
$config['physical']['reportmail'] = '
尊敬的【员工姓名】您好，<br/>
您的年度体检电子报告已经生成，请您登录 “安心体检平台”进行年度体检报告的在线浏览及下载。<br/>
安心体检，祝您检后安心！<br/>
安心体检预约登陆平台：http://tijian.51joying.com/tj<br/>
体检卡号：【体检卡号】';

$config['physical']['reportmsg'] = '
【员工姓名】您好，您的年度电子版体检报告单已生成，请登录“安心体检平台”进行“体检报告”查询。
安心体检预约登陆平台：http://tijian.51joying.com/tj<br/>
体检卡号：【体检卡号】';


//体检通知 年度 入职
$config['physical']['yearlynotice'] = '
                                


                                体 检 通 知 单

尊敬的【员工姓名】：

欢迎参加【公司名称】年度健康体检，为了保证您顺利完成体检，请仔细阅读以下体检须知

一、体检日期及地点

体检有效期： 【体检开始日期】至【体检截止日期】

体检地点：就近选择

二、体检预约说明

预约网站：请登录 “安心体检预约平台”；

a）为了保证体检质量，让您拥有良好的体检环境和贴心的服务，请务必提前3-7个工作日网上预约。如果未经预约，体检中心将会现场婉拒体检。

b）请安心体检预约官网 （tijian.51joying.com/tj），通过输入体检卡号或者身份证，在线预约体检服务。

c）您可以根据自身的需求，以公司优惠价自费升级高人气体检套餐。

祝各位身体健康，快乐常驻！

安心体检预约登陆平台：http://tijian.51joying.com/tj

体检卡号：【体检卡号】

安心体检客服热线：400-816-6768

温馨提示：到检时请向体检中心表明您是安心体检的客户，有助于体检中心快速确认您的身份！












';
$config['physical']['jobnotice'] = '
                                


                                体 检 通 知 单
尊敬的【员工姓名】

恭喜您通过【公司名称】的面试，为了您顺利完成入职体检，请详细阅读以下注意事项：

1）体检有效期：【体检开始日期】至【体检截止日期】

2）预约方式：请登录 “安心入职体检预约平台”(tijian.51joying.com/tj)选择体检门店和体检时间。
（注：请提前3-7天登陆预约平台确定体检时间；对没有预约者，体检中心将会现场婉拒体检，敬请谅解。）

3）携带物品：体检当日，请您空腹并携带本人有效身份证件，前往所选择的体检中心出示预约成功短信，进行身体检查。 

我们预祝您的加入！愿【公司名称】成为您事业的新起点！

安心体检预约登陆平台：http://tijian.51joying.com/tj

体检卡号：【体检卡号】

安心体检客服热线：400-816-6768

温馨提示：到检时请向体检中心表明您是安心体检的客户，有助于体检中心快速确认您的身份！









';

return $config;